In [23]:
from ucimlrepo import fetch_ucirepo 
import pandas as pd
import numpy as np

In [24]:
# fetch dataset 
bank_marketing = fetch_ucirepo(id=222) 
  
# data (as pandas dataframes) 
X = bank_marketing.data.features 
y = bank_marketing.data.targets

In [25]:
X.head()

,age,job,marital,education,default,balance,housing,loan,contact,day_of_week,month,duration,campaign,pdays,previous,poutcome
0,58,management,married,tertiary,no,2143,yes,no,NaN,5,may,261,1,-1,0,NaN
1,44,technician,single,secondary,no,29,yes,no,NaN,5,may,151,1,-1,0,NaN
2,33,entrepreneur,married,secondary,no,2,yes,yes,NaN,5,may,76,1,-1,0,NaN
3,47,blue-collar,married,NaN,no,1506,yes,no,NaN,5,may,92,1,-1,0,NaN
4,33,NaN,single,NaN,no,1,no,no,NaN,5,may,198,1,-1,0,NaN

In [26]:
X.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day_of_week', 'month', 'duration', 'campaign',
       'pdays', 'previous', 'poutcome'],
      dtype='object')

In [27]:
categorical_cols = X.select_dtypes(include=['object']).columns
categorical_cols

Index(['job', 'marital', 'education', 'default', 'housing', 'loan', 'contact',
       'month', 'poutcome'],
      dtype='object')

In [28]:
mode_value = {}
for col in categorical_cols:
    mode_value[col] = X[col].mode()[0]


X = X.fillna(mode_value)

In [29]:
for col in categorical_cols:
    print(f"{col}: {X[col].value_counts()}")

job: job
blue-collar      10020
management        9458
technician        7597
admin.            5171
services          4154
retired           2264
self-employed     1579
entrepreneur      1487
unemployed        1303
housemaid         1240
student            938
Name: count, dtype: int64
marital: marital
married     27214
single      12790
divorced     5207
Name: count, dtype: int64
education: education
secondary    25059
tertiary     13301
primary       6851
Name: count, dtype: int64
default: default
no     44396
yes      815
Name: count, dtype: int64
housing: housing
yes    25130
no     20081
Name: count, dtype: int64
loan: loan
no     37967
yes     7244
Name: count, dtype: int64
contact: contact
cellular     42305
telephone     2906
Name: count, dtype: int64
month: month
may    13766
jul     6895
aug     6247
jun     5341
nov     3970
apr     2932
feb     2649
jan     1403
oct      738
sep      579
mar      477
dec      214
Name: count, dtype: int64
poutcome: poutcome
failure    41860
other       1840
success     1511
Name: count, dtype: int64

In [ ]:
np.sum(X['job'] == 'student')

In [33]:
X['job'] = X['job'].replace(['student', 'housemaid'], 'unemployed')